#include "AimFuncs.h"
#include "Hook/MenuHook.h"


bool mfound = false;
void FindMatrix() {
	static DWORD64 dwGameObjectManager = 0;
	if (!dwGameObjectManager)
		dwGameObjectManager = RVA(FindPattern((PBYTE)"\x48\x8B\x15\x00\x00\x00\x00\x66\x39", "xxx????xx", L"UnityPlayer.dll"), 7);

	DWORD64 ObjMgr = safe_read(dwGameObjectManager, DWORD64);
	if (!ObjMgr) return;
	UINT64 end = safe_read(ObjMgr, UINT64);
	for (UINT64 Obj = safe_read(ObjMgr + 0x8, UINT64); (Obj && (Obj != end)); Obj = safe_read(Obj + 0x8, UINT64))
	{
		UINT64 GameObject = safe_read(Obj + 0x10, UINT64);
		WORD Tag = safe_read(GameObject + 0x54, WORD);
		if (Tag == 5)
		{
			UINT64 ObjClass = safe_read(GameObject + 0x30, UINT64);
			UINT64	Entity = safe_read(ObjClass + 0x18, UINT64);
			LocalPlayer.pViewMatrix = (Matrix4x4*)(Entity + 0xDC);
			printf(StrA("Found matrix!\n"));
			mfound = true;
			return;
		}
		else if (Tag == 20011 && Vars::Misc::AlwaysDay)
		{
			UINT64 ObjClass = safe_read(GameObject + 0x30, UINT64);
			UINT64	Entity = safe_read(ObjClass + 0x18, UINT64);
			DWORD64 Dome = safe_read(Entity + 0x28, DWORD64);
			DWORD64 TodCycle = safe_read(Dome + 0x38, DWORD64);
			safe_write(TodCycle + 0x10, 13.37f, float);
		}
		else if (Tag == 20011 && Vars::Misc::CustomTime) {
			UINT64 ObjClass = safe_read(GameObject + 0x30, UINT64);
			UINT64	Entity = safe_read(ObjClass + 0x18, UINT64);
			DWORD64 Dome = safe_read(Entity + 0x28, DWORD64);
			DWORD64 TodCycle = safe_read(Dome + 0x38, DWORD64);
			safe_write(TodCycle + 0x10, Vars::Misc::Time, float);
		}

	}
}

/*inline void ThirdPerson()//work
{
	if (Vars::Misc::IsThirdPerson && LocalPlayer.BasePlayer)
	{
		auto Flag = safe_read(reinterpret_cast<uintptr_t>(LocalPlayer.BasePlayer) + oPlayerFlags, uintptr_t);
		safe_write(reinterpret_cast<uintptr_t>(LocalPlayer.BasePlayer) + oPlayerFlags, Flag |= 1024, uintptr_t);
	}
}

inline void FakeLag()
{
	if (Vars::Misc::FakeLag)
	{
		safe_write(reinterpret_cast<uintptr_t>(LocalPlayer.BasePlayer) + oClientTickInterval, 0.4f, float);
	}
	else
	{
		safe_write(reinterpret_cast<uintptr_t>(LocalPlayer.BasePlayer) + oClientTickInterval, 0.05f, float);
	}
}*/

void EntityZaLoop()
{
	bool LP_isValid = false;
	BasePlayer* SilentTargetedPlayer = 0;
	BasePlayer* AimEntity = nullptr;
	float FOV = Vars::AimBot::Fov, CurFOV;
	float flSilentSmallestFOV = 999.0f;
	BasePlayer* TargetAimBotPlayer = nullptr;
	if (!LocalPlayer.pViewMatrix || !mfound)
	{
		FindMatrix();
	}

	class BaseProjectile
	{
	public:
		char pad_0x0[0x158]; //0x0
		bool isDeployed; //0x158
		char pad_0x159[0x3]; //0x159
		float hostileScore; //0x15c
		char pad_0x164[0x4]; //0x16
		float deployDelay; //0x170
		float repeatDelay; //0x174
		float nextAttackTime; //0x178
		float lastTickTime; //0x17c
		float nextTickTime; //0x180
		float timeSinceDeploy; //0x184
		bool catchup; //0x188
		char pad_0x189[0x7]; //0x189
		float damageScale; //0x1c8
		float distanceScale; //0x1cc
		float projectileVelocityScale; //0x1d0
		bool automatic; //0x1d4
		char pad_0x1d5[0x3]; //0x1d5
		float reloadTime; //0x1d8
		bool canUnloadAmmo; //0x1dc
		char pad_0x1dd[0x3]; //0x1dd
		float aimSway; //0x1e0
		float aimSwaySpeed; //0x1e4
		float aimCone; //0x1e8
		float hipAimCone; //0x1ec
		bool hasADS; //0x1f0
		bool noAimingWhileCycling; //0x1f1
		bool manualCycle; //0x1f2
		bool needsCycle; //0x1f3
		bool isCycling; //0x1f4
		bool aiming; //0x1f5
		char pad_0x1f6[0x2]; //0x1f6
		float nextReloadTime; //0x1f8
		bool isReloading; //0x1fc
		char pad_0x1fd[0x3]; //0x1fd
		float reloadPressTime; //0x200
	};

	DWORD64 BaseNetworkable;
	if (isSteam == -1) BaseNetworkable = safe_read(GetModBase(StrW(L"GameAssembly.dll")) + g_BN, DWORD64);
	else BaseNetworkable = safe_read(GetModBase(StrW(L"GameAssembly.dll")) + g_BN_Steam, DWORD64);
	DWORD64 EntityRealm = safe_read(BaseNetworkable + 0xB8, DWORD64);
	DWORD64 ClientEntities = safe_read(EntityRealm, DWORD64);
	DWORD64 ClientEntities_list = safe_read(ClientEntities + 0x10, DWORD64);
	DWORD64 ClientEntities_values = safe_read(ClientEntities_list + 0x28, DWORD64);
	if (!ClientEntities_values) return;
	int EntityCount = safe_read(ClientEntities_values + 0x10, int);
	DWORD64 EntityBuffer = safe_read(ClientEntities_values + 0x18, DWORD64);



	for (int i = 0; i <= EntityCount; i++)
	{
		DWORD64 Entity = safe_read(EntityBuffer + 0x20 + (i * 0x8), DWORD64);
		if (Entity <= 100000) continue;
		DWORD64 Object = safe_read(Entity + 0x10, DWORD64);
		if (Object <= 100000) continue;
